Revit 2027 API
AdvancedLayered.SurfaceNdfType Property
 The property labeled "NDF" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SurfaceNdfType { get; }
Public Shared ReadOnly Property SurfaceNdfType As String
	Get
public:
static property String^ SurfaceNdfType {
	String^ get ();
}
static member SurfaceNdfType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".
See Also
Reference
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace